{
  "backend/main.mo": "Main Motoko actor implementing user data storage with CRUD operations for legal documents, analysis results, and questions, including blob storage mixin integration.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including document upload, language toggle, question input, voice input, analysis results display, and chart visualization with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, pages, hooks, contexts, and styling for the legal analysis application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark mode variables for a professional legal-tech design palette.",
  "frontend/index.html": "HTML entry point for the LexAI application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router, theme provider, language provider, layout wrapper, and toast notifications.",
  "frontend/src/components/AnalysisResults.tsx": "Comprehensive results display component rendering 11 analysis sections including case summary, legal issues, law sections, strength chart, strong/weak points, risk assessment, and disclaimer.",
  "frontend/src/components/DocumentUpload.tsx": "File upload component with drag-and-drop interface supporting PDF and DOCX files, including validation, progress tracking, and error handling.",
  "frontend/src/components/LanguageToggle.tsx": "Button component for toggling between English and Tamil languages with icon and localized text display.",
  "frontend/src/components/Layout.tsx": "Application layout wrapper with header containing logo and language toggle, main content area, and footer with attribution link to caffeine.ai.",
  "frontend/src/components/LegalDisclaimer.tsx": "Displays a destructive alert with a warning icon showing a legal disclaimer message, using the Alert component from the UI library and translations from LanguageContext.",
  "frontend/src/components/QuestionInput.tsx": "Provides a textarea for legal questions with voice input support and an analyze button, managing input state and submission with loading states and disabled states.",
  "frontend/src/components/StrengthChart.tsx": "Renders a bar chart comparing plaintiff and defendant strength percentages using Recharts, with gradient cards displaying the numeric values and a responsive chart visualization.",
  "frontend/src/components/VoiceInputButton.tsx": "A button component that toggles voice recording using the useVoiceInput hook, showing different icons for recording/idle states and displaying toast notifications for status updates.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for language switching between English and Tamil, storing the preference in sessionStorage and offering a translation function with comprehensive UI text mappings.",
  "frontend/src/hooks/useActor.ts": "Manages the creation and caching of the backend actor using React Query, handling both authenticated and anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication integration with React context, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options for ICP authentication.",
  "frontend/src/hooks/useQueries.ts": "Exposes a mutation hook for analyzing legal cases that accepts document and question inputs, generates mock legal analysis data, saves it via the backend actor, and handles success/error notifications.",
  "frontend/src/hooks/useVoiceInput.ts": "Wraps the Web Speech Recognition API to provide voice input functionality with support for English and Tamil languages, managing recording state and transcript accumulation.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for light/dark theme color schemes using OKLCH color space, including variables for UI components like sidebar, cards, borders, and charts.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClient for data fetching, InternetIdentityProvider for authentication, and imports global styles.",
  "frontend/src/pages/AnalysisPage.tsx": "Main analysis page component that orchestrates document upload, question input, and displays AI-powered legal analysis results using a two-column card layout with document upload and question sections.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that extends the default theme with custom OKLCH color variables, typography plugins, container queries, animations (accordion), custom shadows, and font families (Inter, Merriweather).",
  "project_state.json": "Project metadata file documenting LexAI as a full-stack bilingual (Tamil/English) legal-tech application with React frontend, FastAPI backend, OpenAI integration for document analysis, and MongoDB persistence, including architectural notes and feature tracking."
}